/* Test */

import React from 'react';
import { connect } from 'react-redux';
import { Button, Toast } from 'antd-mobile';
import { bindActionCreators } from 'redux';
import { wxPay } from '../../a_action/shop-action';
import Config from '../../config';
import P from 'prop-types';
import _ from 'lodash';
class TestContainer extends React.PureComponent {
    constructor(props) {
        super(props);
        this.state = {
            source: [
                "银翔路819弄中暨大厦",
                "上海市嘉定区南翔镇众仁路399号B座1楼",
                "广东省深圳市罗湖区",
                "浙江省宁波市江东区",
                "安徽省合肥市包河区徽州大道与望江路交口金三角建材商城西门向北100米",
                "安徽省合肥市庐阳区桃源路66号中铁国际城售楼处对面",
                "河北省廊坊市霸州市迎宾山水花园南侧商业-19号",
                "台湾省 台南市东区",
                "台湾省 台北市中正区",
                "浙江省 宁波市北仑区",
                "台湾省台南市中西区",
                "台湾省台南市安平区",
                "安徽省合肥市蜀山区黄山路468号易居同辉南苑2幢商109",
                "安徽省合肥市瑶海区裕溪路柳荫塘路交口盛大国际灯饰城一层B31-B32",
                "安徽省芜湖市繁昌县电子商务产业园",
                "安徽省铜陵市义安区五松镇南湖路22号二楼",
                "安徽省铜陵市北斗星城C3/4/5栋一层1028商铺",
                "安徽省合肥市长丰县蒙城北路北城世纪城1期祥徽苑4#117商铺",
                "江苏省泰州市靖江市渔婆路95-4号",
                "江苏省泰州市海陵区凤凰东路文创大厦505-506",
                "江苏省泰州市泰兴国庆东路58-4号",
                "江苏省泰州市兴化市昭阳镇南郊居委会长安转盘西北侧3幢",
                "江苏省泰州市姜堰区中天清华园光华路86号",
                "安徽省宣城市郎溪县建平镇中港东路华润苏果购物广场F幢136.137号",
                "台湾省台南市北区",
                "安徽省亳州市利辛县城关镇文州路西段南侧嘉和阳光城2#楼102",
                "安徽省亳州市蒙城县牛群商贸城307省道红绿灯西侧翼猫体验服务中心",
                "安徽省亳州市涡阳华都大道666号尚居都家居建材城5幢2层",
                "河北省廊坊市燕郊镇北蔡各庄村",
                "河北省廊坊市广阳区朝阳特价商城南侧（和平路79号）",
                "河北省廊坊市固安县新中东街红树湾1号1-0104",
                "河北省廊坊市安次区龙河盛都小区第9002栋一单元一层103号",
                "安徽省六安市裕安区磨子潭路长城钢构一楼",
                "安徽省六安市金安区迎宾大道与佛子岭路交口向北500米一品尚都9号楼门面",
                "河北省廊坊市永清县益昌路123号",
                "安徽省亳州市谯城区市政府南门丽阳春都西大门向南20米翼猫科技",
                "安徽省阜阳市一道河路666号（蓝色雅典4#B楼）4号106室",
                "安徽省阜阳市颍东区向阳办事处和谐家苑8号商铺楼",
                "安徽省阜阳市颍泉区周鹏办事处颍东路99号临沂商城B17-2#105室",
                "台湾省台南市安南区",
                "安徽省淮南市凤台县城关镇体育文化中心",
                "天津市河北区榆关道413号",
                "天津市南开西营门大街",
                "天津市河东区七纬路34号",
                "天津市和平区多伦道252号商铺",
                "天津市南开区长江道凯立天香家园南",
                "天津市西青区紫阳大道中北工业园汪庄园",
                "天津市河西区马场佟楼公交站西吴家窑大街37号",
                "安徽省马鞍山市健康路同济花园15栋底商15-8号",
                "湖南省株洲市荷塘区新塘路铂金时代102.202号店面",
                "湖南省株洲市天元区大江官邸临街门面4楼",
                "湖南省株洲市芦淞区服务站（太子路）889号",
                "湖南省株洲市石峰区青石路148号",
                "湖南省醴陵市青云南路5号（百富花园）翼猫服务中心",
                "江苏省无锡市锡山区锡北镇泾新村锡港东路217号",
                "江苏省无锡市春申路85号",
                "江苏省宜兴市阳羡东路万达广场北门117号",
                "江苏省无锡市滨湖区仙蠡墩家园南片商铺33-4",
                "江苏省江阴市毗邻东路11号",
                "江苏省无锡市惠山区玉祁街道溪秀苑3-4#商铺",
                "江苏省无锡市新吴区花郡家园58-21",
                "安徽省阜阳市颍上县慎城镇智泉街8号楼216号商铺",
                "北京市丰台区芳城园一区5号楼1层79-3",
                "北京市石景山区城通街26号院（长安街金融中心）8号楼1404室",
                "北京市怀柔区滨湖小区61号楼102底商",
                "北京市密云县滨河路132号",
                "北京市平谷区文化南街8号楼2层8-13",
                "北京市顺义区前进花园一区2楼3门101",
                "辽宁省朝阳市龙城区锦绣小区二期10号楼网点",
                "辽宁省朝阳市北票七门购物中心南门西侧健康路1-2号",
                "辽宁省朝阳市建平县叶柏寿街道办事处育才社区",
                "辽宁省朝阳市双塔区新华路3段9-2号",
                "辽宁省朝阳市喀喇沁左翼蒙古族自治县民族街2段",
                "辽宁省凌源市红山路西段盛世华城A区13#-01018",
                "安徽省宣城市宣州区向阳大道174号",
                "天津市武清区王庆坨镇二街村新开路16号",
                "辽宁省鞍山市铁西区一道街47栋S1号",
                "辽宁省鞍山市铁东区解放东路50号1-2层S1",
                "辽宁省鞍山市立山区临城街11号东河湾小区商业网",
                "安徽省蚌埠市淮上区通成紫都花苑商业1#楼2号商铺",
                "安徽省蚌埠市蚌山区文化广场华夏商都A区东门翼猫科技",
                "安徽省蚌埠市怀远县涡北新城区新怀社区大组23号",
                "安徽省合肥市肥东瑞士花园小区南大门翼猫科技",
                "安徽省合肥市肥西县上派镇卫星社区城中村门面房B-C第5-6号门面",
                "安徽省六安市霍山县衡山镇淠河新区花园北路36号翼猫科技",
                "安徽省芜湖市鸠江区芜湖赛格建材家居广场C区3C017",
                "安徽省芜湖市镜湖区镜湖世纪城绿地新都会C座309",
                "安徽省芜湖市弋江区中央城12栋102",
                "江苏省常州市钟楼区新港路青风公馆8-1号商铺",
                "江苏省溧阳市溧城镇台港东路28号108室",
                "江苏省常州市新北区原山雅居37号",
                "江苏省常州市天宁区香梅花园关河东路70号",
                "江苏省常州市金坛市花街神树巷21号",
                "江苏省常州市武进区湖塘镇人民西路3号",
                "江苏省扬州市高邮经济开发区秦邮路A2段-1",
                "江苏省扬州市江都区仙女镇龙城路3号兴隆花苑高层商住楼102室",
                "江苏省扬州市仪征市金阳光中豪国际建材馆2楼1栋271号",
                "江苏省扬州市邗江区维扬路555号",
                "江苏省扬州市广陵区文昌中路6号(华泰首席国际大厦)_-102",
                "湖北省武汉市武昌区临江大道98号万达公馆19号",
                "湖北省武汉市江岸区兴业南路紫御公馆1单元13号",
                "湖北省武汉市青山区友谊大道与和平大道之间园林路62-3-1号商铺",
                "湖北省武汉市江汉区姑嫂树村常青南园第三期A-1、A-2、A-3裙楼幢1-2层商12号",
                "湖北省武汉市洪山区书城路鸿城家园8栋门面翼猫",
                "湖北省武汉市汉南区纱帽街月亮湾西路圣特立国际花园10-8号商铺",
                "湖北省武汉市硚口区园博园西路城华路华生汉口城市广场北区23栋1001翼猫",
                "湖北省武汉市江夏区经济开发区大桥新区菩提苑202栋单元1层4室",
                "湖北省武汉市蔡甸区大拇指广场8-9-10号翼猫科技",
                "湖北省武汉市汉阳区龙阳大道与芳草路交叉国际小商品城27号",
                "湖北省武汉市黄陂区木兰大道万基广场2楼",
                "湖北省武汉市新洲区邾城街余姚村龙腾大道以南齐安大道以西祥和世家2栋108",
                "湖北省武汉市东西湖区将军二路将军新村JH112-JH113号商铺",
                "天津市东丽区万新街道昆仑南路-8号-1号",
                "天津市津南区咸水沽镇南华路新旭园底商5-8",
                "安徽省舒城县城关镇梅河东路翼猫体验服务中心",
                "湖北省咸宁市咸安区咸宁大道126-3号",
                "安徽省广德县桃州镇时代华府138-139号",
                "北京市门头沟区双峪路39号",
                "湖南省湘潭市湘乡市东山新城励志大道凯旋名都商住小区门面第一栋第一层109.110.111号门面",
                "湖南省湘潭市雨湖区韶山东路280号诚信大厦一楼",
                "湖南省湘潭市岳塘区芙蓉中路56号财富明珠一号楼",
                "安徽省安庆市太湖县晋熙镇观音小学对面翼猫体验服务中心",
                "安徽省安庆市迎江区迎江世纪城绿地启航社3栋6号",
                "安徽省安庆市大观区菱北西路长江广场6号楼1楼12-15号翼猫服务站",
                "安徽省安庆市宿松县孚玉镇孚玉东路翼猫科技",
                "安徽省安庆市宜秀区光彩大市场一期B9栋2-6号",
                "安徽省桐城市毛河车站公交站牌后面",
                "安徽省安庆市怀宁县育儿路祥和家园门面房1-3号",
                "安徽省蚌埠市五河县华芳国际27幢103,104门面翼猫科技",
                "安徽省蚌埠市固镇县华海悦府东门翼猫科技",
                "湖北省鄂州市鄂城区古城南路76号滨湖小区3号楼底层门面",
                "湖北省鄂州市梁子湖区梁子镇兄弟住宅楼4、5、6号门面",
                "湖北省鄂州市华容镇葛华新城楚藩大道366号光谷润园小区1号楼第1层10号门面",
                "安徽省滁州市明光市招信路333号星光商贸城14幢19号商铺",
                "天津市北辰区环瑞南路商业街10号",
                "湖北省咸宁市赤壁市蒲圻大道铜锣湾广场1楼4-101、4-102",
                "湖北省咸宁市嘉鱼县君邻天下小区2栋102---103号",
                "湖北省咸宁市通山县洋河金湾24号楼106.107.108号商铺",
                "湖北省十堰市茅箭区天津路88号大洋五洲A-36栋1-50号",
                "湖北省十堰市张湾区北京北路阳光栖谷栖谷天街L07号商铺",
                "河南省洛阳市洛龙区王城大道以西、英才路以南、美茵街两侧美茵湖高尔夫花园五期52幢110号房",
                "河南省洛阳市西工区芳林路芳林大厦102号商铺",
                "河南省洛阳市涧西区联盟路五十三号街坊名仕嘉园10幢106",
                "江苏省扬州市宝应县都天庙巷31-1号",
                "北京市延庆区延庆镇南菜园舜泽园小区底商26-7",
                "湖北省随州市曾都区擂鼓墩大道59号",
                "湖北省咸宁市崇阳县天城镇新建路32A",
                "湖北省黄冈市黄州区黄州大道江岸名都一层商铺翼猫科技",
                "江西省萍乡市上栗县鑫岛尚都大门28号——30号",
                "江西省萍乡市芦溪县武功大道移动公司旁",
                "江西省萍乡市安源区洪山路口（嘉年华城5栋2楼）",
                "江西省萍乡市湘东区G320国道旁南方家居三楼",
                "上海市闵行区吴中路2364-1号",
                "上海市普陀区富平路988号",
                "上海市青浦区青竹路21号",
                "上海市徐汇区沪闵路9234号",
                "上海市静安区余姚路177号",
                "安徽省滁州市琅琊区琅琊西路锦江之星对面",
                "湖北省恩施州恩施市金桂大道硒都茶城金桂公馆19栋101-103",
                "安徽省滁州市南谯区清流路212号（水银山庄）门面房5室",
                "辽宁省葫芦岛市连山区兴工路28-18号楼K、L室",
                "辽宁省葫芦岛市龙港区玉皇商城汽配城",
                "湖北省黄石市黄石港区迎宾大道盛昌公馆一楼翼猫服务站",
                "湖北省黄石市西塞山区沿湖路803号",
                "湖北省黄石市下陆区团城山苏州路丰竹园小区",
                "安徽省淮南市田家庵区民生淮河新城三期107号",
                "安徽省淮南市寿县瑶海大市场15号楼135商铺翼猫科技",
                "上海市徐金山区杭州湾大道1966号",
                "安徽省宿州市埇桥区银河一路都市华庭CI#102室",
                "上海市黄浦区半淞园路621A",
                "安徽省淮南市潘集区九华山路",
                "安徽省淮南市谢家集长江商贸城入口",
                "安徽省芜湖市无为县中俊理想城商业街22栋101门面",
                "河南省信阳市新华西路金杯花园53号",
                "河南省信阳市平桥区万象城彩虹苑小区17号楼第1层102号第2层202号",
                "河北省廊坊市香河县香武路西侧阳光花园（1号商住楼2单元4号门）",
                "湖北省咸宁市通城县隽水镇民主路玉秀苑小区（幼儿园侧）",
                "安徽省霍邱县城关镇光明大道北段57号",
                "湖北省荆门市水产路与果园一路交叉路口（天虹居1栋）",
                "湖北省荆门市掇刀区虎牙关大道火车桥南侧1号",
                "河北省沧州市运河区浮阳南大道",
                "河北省沧州市新华区建设北大街颐和花园底商",
                "河北省承德市双滦区御道商业街156号",
                "湖南省益阳市赫山区龙洲南里298号",
                "湖南省益阳市资阳区迎春路与幸福路交接口",
                "辽宁省铁岭市银州区光荣街30，临街网点",
                "河北省廊坊市文安县左各庄镇福新新村西",
                "河北省承德市双桥区大石庙迎宾佳苑底商",
                "河南省洛阳市老城区九都路立交桥与定鼎南路交叉口定鼎广场4号楼1号商铺",
                "辽宁省葫芦岛市绥中县中央路1段41号",
                "安徽省合肥市巢湖市东塘路永利车行二楼",
                "山东省聊城市（幸苑大酒店）兴华东路18号（市中级法院东侧）",
                "山东省济南市经十西路17323号",
                "山东省济南市经一路253号",
                "山东省济南市历城区黄南路5号（5-27）",
                "山东省济南市市中区魏家庄万达广场帝景苑1号楼102室",
                "山东省济南市历下区沁园路1772号",
                "上海市崇明岛长兴镇金滂路199弄3号101.102商铺",
                "山东省济南市天桥区经十路14713号诚信商务楼2楼",
                "辽宁省盘锦市兴隆台区市府小区1-49-164-1.2",
                "辽宁省盘锦市大洼区田家镇昆仑新天地小区B3-2号商网",
                "辽宁省盘锦市双台子区吉祥小区14幢20号门市",
                "江苏省淮安市淮安区易郡龙腾1号楼110室",
                "江苏省淮安市淮阴区幸福城A-7幢商住楼7-102室",
                "江苏省淮安市清江浦区富强村紫晶花苑小区105号",
                "安徽省阜阳市太和县城关镇民安家园门面房18-20户",
                "山东省潍坊市高密市醴泉大街2039号",
                "河南省新乡市牧野区和平路126号真龙003号楼",
                "河南省新乡市开发区新飞大道与化工路交叉口14号翼猫科技",
                "四川省成都市成华区华林二路",
                "四川省成都市青羊区东顺路18号附19号",
                "四川省成都市武侯高新天府四街199号长虹大厦B座1105号",
                "四川省成都市锦江区水杉街201号蓝谷地里外2楼19-20号商铺",
                "四川省成都市金牛区金沙路22号105-106号",
                "安徽省马鞍山市和县历阳镇禹锡东侧和县一中西侧铂丽书香华府13栋12号",
                "辽宁市丹东市振兴区福春街3-32号",
                "辽宁省丹东市九江街35-5号",
                "辽宁省沈阳市浑南区漪霞街8-40号11门",
                "辽宁省沈阳市铁西区卫工南街10-2号7门",
                "辽宁省沈阳市沈河区沈阳路二十甲7-8轴",
                "上海宝山区水产西路680弄4号楼1层118室",
                "辽宁省沈阳市皇姑区同江街15号",
                "辽宁省沈阳市和平区振兴街9号2门",
                "辽宁省沈阳市大东区滂江街117号",
                "湖北省孝感市高新开发区同升社区黄陂路太阳巷1号",
                "北京市东城区金鱼池中街2号院1号楼1层1-3号",
                "辽宁省葫芦岛市兴城市龙兴路18甲-1-G门室",
                "河南省三门峡市开发区舒馨苑2号楼3楼东户",
                "安徽省祁门县祁山镇鲲鹏岭秀城10号楼1011室",
                "上海市浦东新区昌邑路61号",
                "湖北省随州市随县新历山第五区物业对面",
                "湖南省衡阳市珠辉区富东大厦二楼",
                "上海市杨浦区大连路844号",
                "湖南省衡阳市蒸湘区立新大道（英伦华府对面）",
                "山西省晋中市开发区高村段（柏林春天一号楼一号商铺）",
                "湖南省衡阳市耒阳市五梅路A3栋",
                "内蒙古赤峰市松山区宝通大厦20层",
                "北京市朝阳区成寿寺路136号院2号楼105号门市",
                "内蒙古赤峰市红山区万达广场C区6号楼6楼",
                "湖南省衡阳市衡东县衡岳北路1003号锦泰花园S1栋",
                "江苏省盐城市东台市海陵南路30号中基商业街20-21",
                "湖南省衡阳市雁峰区黄白路55号天嘉汉庭3楼",
                "江苏省苏州市常熟市顺益虞山商业街2幢121、123、125号",
                "湖南省衡阳市衡山县开云镇衡山大道龙宇小区2楼",
                "江苏省镇江市句容市开发区梅花苑12幢101-103号",
                "湖南省湘潭市湘潭县易洛河镇海棠北路716-720",
                "湖南省衡阳市石鼓区华源建材市场B7栋二楼",
                "湖南省邵阳市双清区东大路中富油脂对面",
                "湖北省黄冈市蕲春县漕河镇蕲阳北路美景国际新城B104-106号",
                "湖南省邵阳市大祥区学院路七里坪电大对面翼猫科技",
                "天津市滨海新区自贸试验区（中心商务区）海门大桥辅路东侧海河南侧极地广场33-4",
                "台湾省台南市南区",
                "北京市昌平区鼓楼西街12-7底商",
                "浙江省台州市仙居县工业路243号",
                "湖南省益阳市桃江县桃花江镇金盆加油站对面（美人窝路口）",
                "湖南省娄底市娄星区湘中大道怡河园一号",
                "江苏省南京市浦口区浦泗路19号-5慧港电商创业园118室",
                "江苏省南京市秦淮区永丰大道36号天安数码城E6栋201",
                "江苏省南京市江宁区胜太东路179号1-5",
                "江苏省南京市雨花台区宁南大道9号-1",
                "江苏省南京市建邺区水西门大街291号220室",
                "江苏省南京市鼓楼区幕府南路230-9号",
                "江苏省南京市玄武区墨香路26-15号",
                "湖北省黄石市大冶市长安南路兴盛花园",
                "湖南省岳阳市云溪区大汉新城c区16栋1楼",
                "湖南省岳阳市君山区君尚一品一期3#108/109",
                "湖南省岳阳市望岳路213好（广济医院斜对面）",
                "湖南省株洲县津口东路东城国际",
                "江苏省苏州市张家港市杨舍镇长安南路312号",
                "浙江省湖州市安吉县递铺镇芜园西路108号",
                "天津市静海金岛假日酒店20米",
                "湖南省邵阳市邵阳县塘渡口镇金源路",
                "安徽省池州市青阳县南溪府邸6幢1-2号",
                "安徽省六安市金寨县现代产业园大别山物流园H05-125",
                "山东省济南市济阳县济北龙海私营园海尔街南、龙源路东",
                "安徽省池州市站前区玫瑰园3#102室门面",
                "上海市奉贤区南桥菜场路59号一楼",
                "天津市宝坻区宝境檀香东门36号商业街8号",
                "湖南省长沙市天心区暮云镇万家丽南路御邦小区84栋110号",
                "湖南省长沙市岳麓区谷山乐园二期B栋01商铺",
                "湖南省长沙市浏阳市金沙北路515号到519号",
                "安徽省淮北市相山区孟山北路与黎苑路交口翼猫科技",
                "长沙市开福区新河街道芙蓉中路一段88号天健芙蓉盛世二期",
                "长沙市雨花区万科金域华府三商B229",
                "长沙市杨家山立交桥东北角东方之珠大厦东侧人民东路21号2层",
                "山东省青岛市市南区香港中路9号香格里拉中心办公楼2601室",
                "山东省青岛市崂山区劲松七路236号63网点",
                "山东省青岛市李沧区九水东路37号-18",
                "山东省青岛市市北区福州北路169号翼猫科技",
                "山东省青岛市城阳区正阳中路17-1号",
                "山东省青岛市黄岛区井冈山路632-2号",
                "福清市清昌大道侨荣城2号楼2层",
                "四川省成都市新津县五津镇兴园1路105号",
                "天津市蓟县渔阳镇人民西大街13号副2号",
                "江苏省南通市开发区上海东路幸福天地11幢102室",
                "南通市港闸区永兴大道388号1幢1层",
                "南通市海安县义乌商贸城20栋101-105",
                "天津市蓟县渔阳镇人民西大街13号副2号",
                "山东省济南市平阴县欣佳园小区",
                "昆山开发区天骄翡翠名都3-5号楼2室6-7号",
                "安徽省宿州市萧县安粮国邦美家居南侧",
                "江苏省徐州市贾汪区徐海路66号欧蓓莎B29-116",
                "徐州市云龙区和平妇产医院北侧50米（香溪左岸商务楼B-113）",
                "江苏省徐州市泉山区科技城软件市场2区，108室",
                "江苏省徐州市泉山区雨润全球采购中心，二层，42栋10号",
                "浙江省嘉兴秀洲区洪兴西路1638号",
                "浙江省嘉兴市南湖区解放街道东升东路473号",
                "上海市长宁区长宁路2057号",
                "上海市松江区鼎源路618号（时尚谷创业园39号楼1层）",
                "湖南省怀化市经开区小商品加工园B10栋101号",
                "湖北省宜昌市伍家区沿江大道特165号",
                "湖北省宜昌市夷陵区长江市场梅珑镇锦江东路1101-1103",
                "湖北省宜昌市西陵区樵湖二路锦绣嘉苑2号楼103室",
                "内蒙古自治区呼和浩特市新城区成吉思汗大街丁香河畔",
                "内蒙古自治区呼和浩特市回民区成吉思汗大街梦溪苑小区二号楼六号商铺",
                "内蒙古自治区呼和浩特市玉泉区锡林郭勒南路恒泰盛都一楼展厅",
                "内蒙古自治区呼和浩特市金桥开发区电子产业园区",
                "江西省萍乡市莲花县金城大道琴亭建材家居市场",
                "山东省淄博市张店区人民路1号甲十七号",
                "山东省淄博市博山区沿河西路8号甲20",
                "广东省东莞市长安镇万达金街中门东路1092-1093号铺",
                "安徽省滁州市来安县塔山东路（中央大街）16幢114室",
                "山东省淄博市临淄区齐国商城22号楼",
                "山东省淄博市淄川区松龄东路128甲26号",
                "山东省德州市齐河县黄河大道金融中心C座108号",
                "山东省淄博市周村区东门路187号兰雁嘉园附近",
                "山东省德州市陵城区唐城路中段路北",
                "山东省德州市德城区新华街道办事处湖滨南路259号阳光新天地生活广场",
                "安徽省黄山市歙县徽城镇北关村7-9号店面",
                "安徽省滁州市全椒县晶禾金街2号楼门面102室",
                "四川省绵阳市江油市城区李白大道中段489号宏安熙瑞城1栋1楼2号",
                "广东省东莞市大岭山镇冚村莞长路旁大诚建材家居广场A栋1018号商铺",
                "江苏省南通市崇川区青年东路涌鑫八达通广场2-111#",
                "江苏省南通市通州区跟路古镇灯饰城M栋108",
                "浙江省台州市黄岩区东城街道劳动南路574号",
                "浙江省台州市椒江区云西路92号",
                "浙江省台州市路桥区灵山街1058号",
                "湖北省黄石市阳新县兴国镇锦富路（翼猫）",
                "四川省成都市蒲江县鹤山镇全兴路11号附2号",
                "辽宁省铁岭市开原市哈大路178号1003号",
                "张家界市永定区中天鹭鸶湾一期A区门面",
                "辽宁省铁岭市调兵山市兀术花园小区D2楼西12号门市",
                "浙江省湖州市吴兴区吴兴大道2900号",
                "浙江省湖州市南浔区南浔同心路722号",
                "湖南省常德市临澧县安福镇安福东路609号",
                "江苏省镇江市润州区运河路90号二楼",
                "江苏省镇江市丹徒区丹徒画意江南小区43号楼105商铺",
                "江苏省镇江市润州区华都名城美景苑75幢第1至第2层0001室",
                "江苏省南通市海门市浦江路36号",
                "上海市虹口区恒业路409号",
                "湖南省衡阳市衡南县云集镇新塘路",
                "湖南省岳阳市临湘市永昌西路170号侧翼猫体验服务中心",
                "安徽省淮北市烈山区南湖雅苑28幢一单元一层116",
                "辽宁省锦州市凌河区上海路5号",
                "辽宁省锦州市太和区石化小区C",
                "湖北省荆州市武德路1号新加坡国际五期105-106翼猫",
                "山西省太原市小店区平阳路19号黄河京都大酒店旁翼猫科技",
                "山西省太原市杏花岭区五龙口街嘉地中心（东中环与五龙口交汇处)",
                "山西省太原市双塔北路116号第2幢1007号房",
                "湖北省荆州市万达广场户外步行街A3-1100",
                "浙江省嘉兴市平湖市城南西路764-766",
                "襄阳市襄州区汉江一路民发世界城二期D块地悦华里第一幢103号",
                "湖北省襄阳市襄城区檀溪路山水佳园",
                "山西省朔州市朔城区古北西街奥林花园南门东100米",
                "湖南长沙市长沙县星沙开发区向阳路新长海步行街入口二楼201",
                "山东省聊城市茌平县信发街道顺河路北段986号",
                "湖南省常宁市培元办事处南丰北路15号",
                "江西省新余市渝水区渝州大道春江明月小区577号",
                "北京市通州区翠屏里小区216号楼412底商",
                "湖南省株洲市攸县富康社区攸州大道机电城门面",
                "湖北省孝感市应城市月圆路金港一品28号楼S-4126商铺",
                "湖北省黄冈市团风县团风大道世纪华府103号",
                "湖北省襄阳市樊城区春园路10号蓝钻领域2栋1层101-3室",
                "江西省景德镇珠山区通站路恒业灯类摩尔街8栋89-91号",
                "福建省厦门市湖里区岐山路388号111门店翼猫科技",
                "厦门市湖里区岐山路388号111门店翼猫科技",
                "四川省成都市双流县电视塔三段22-28号",
                "辽宁省沈阳市于洪区细河南路123号翼猫科技体验服务中心",
                "四川省成都市郫筒镇龙腾二路47-51",
                "河北省邢台市桥西区汽车文化名城D-2-7区",
                "河北省邢台市桥东区北外环长信段路南梁庄北路",
                "江西省景德镇市乐平市乐平大道中远大名城116-117号",
                "湖南省郴州市北湖区万华路238号北湖体验服务中心",
                "湖南省临武县武水镇临武大道怡居苑2号门面",
                "湖南省郴州市苏仙区滨河路碧桂园泊林一栋137号翼猫体验服务中心",
                "江西省新余市分宜县万年路红星美凯龙家居广场一楼A8051",
                "四川省德阳市旌阳区沱江东路5号",
                "四川省绵竹市剑南镇城东新区景观大道东方明珠2栋一层105-106号",
                "福建省莆田市秀屿区市政广场至尊花园102号",
                "福建省莆田市城厢区荔城中大道276号翼猫科技",
                "湖北省十堰市郧西县滨河路天润华庭一楼",
                "辽宁省鞍山市岫岩满族自治县玉园小区西门翼猫科技",
                "江苏省苏州市虎丘区滨河路588号3幢708室",
                "江苏省苏州市吴江区松陵镇笠泽路199号佰亿左岸广场119",
                "江苏省苏州市相城区采莲路293号、289-301号、289-302号、291-301号",
                "江苏省苏州市吴中区长桥街道和景西区1幢107室",
                "江苏省苏州市姑苏区苏站路540号",
                "河南省开封市金明区郑开大道12号翼猫科技",
                "河南省开封市鼓楼区寺后街9号2楼翼猫科技",
                "河北省衡水市阜城县腾飞东路佰瑞廷小区正门东88米",
                "辽宁省大连市中山区天津街国泰港汇中心",
                "辽宁省大连市沙河口区兴工街18-12",
                "辽宁省大连市西岗区长春路335-18号",
                "万载县和谐家园第二期44栋102.103号店面",
                "江苏省镇江市丹阳市",
                "江苏省盐城市大丰区大中镇工农西路121号翼猫科技",
                "四川省泸州市纳溪区人民西路一段6号",
                "江苏省淮安市涟水县长青路盛大开元名都小区8-132号",
                "淮安市洪泽区天泽名城沿街商铺7-01、7-02号",
                "四川省泸州市龙马龙马潭区安宁大道148号俊浩互联网产业园",
                "四川省泸州市江阳区康宁路2号3号楼2层2号",
                "江苏省宿迁市沭阳县建陵新村7栋A-1-AA1室",
                "泗阳县众兴镇运河印象商业街2-1号楼",
                "安徽省黄山市屯溪区徽州大道17-7",
                "浙江省杭州市下城区永华街31号",
                "浙江省杭州市西湖区",
                "浙江省台州市温岭市太平街道河滨路628号塔下村三区13幢3号",
                "浙江省台州市临海市大洋街道商业街161号",
                "丰城市子龙花园百合苑5栋11-12号翼猫科技丰城服务中心",
                "江西省南昌市丽景路938号（丽景路与凤凰中大道交界口）",
                "江西省南昌市青云谱区何坊西路与迎宾大道交汇处(巨成广场金山街)",
                "江西省南昌市西湖区抚生路669号众鑫城上城",
                "江西省南昌市青山湖区艾溪湖北路艾溪康桥营销中心旁翼猫科技",
                "江西省南昌市东湖区二七北路与青山南路交汇处江南都市花园",
                "江西省南昌市南昌县",
                "袁州区袁河路168号翼猫科技袁州服务中心",
                "福建省福州市鼓楼区西二环98号万商大厦二楼",
                "福建省福州市仓山区金山榕城广场8号楼307",
                "辽宁省锦州市凌海市",
                "辽宁省锦州市北镇市",
                "辽宁省铁岭市凡河区金月蓝湾18-07-9",
                "新城丽景18A-9",
                "辽宁省鞍山市台安县台安镇东市路西金墅花园1号楼北4北5",
                "庄河市新华街道向阳路一段267-4(1-4号)",
                "辽宁省鞍山市海城市海州管理区北关街田水委D型别墅田水东街9甲栋3号",
                "辽宁省本溪市明山区唐家路73栋5号",
                "辽宁省本溪市桓仁县桓仁镇向阳街25组08幢14号",
                "河南省许昌市魏都区",
                "福建省福州市晋安区福兴大道49号大同国际电商城",
                "辽宁省营口市鲅鱼圈区辽海中盐大厦1#门市一层",
                "营口市西市区镜湖西路北27-甲8号格林滨海湾南门东北60米",
                "辽宁省大石桥市百亿百年汇15号门店",
                "湖北省荆州市仙桃市沙办黄金大道新街C栋101.102号",
                "河北省保定市竞秀区利家街881号",
                "湖南省岳阳市岳阳县",
                "湖南省岳阳市平江县开发区育才中路",
                "湖南省郴州市桂阳县龙潭街道园艺路统征大楼1号门面翼猫体验服务中心",
                "湖南省郴州市宜章县保盛幸福城1栋111号门面",
                "湖南省娄底市双峰县永丰镇艺芳路艺芳新城18栋113-116",
                "湖南省娄底市冷水江市江南路博长金水湾住宅小区2栋203-204号门面",
                "涟源市石马山荷花广场翼猫科技（友谊宾馆隔壁)",
                "湖南省常德市武陵区常德大道、东方美景小区一期旁",
                "广东省惠州市惠州市东湖西路238号和庆花园B栋第一层108号商场",
                "广东省阳江市江城区",
                "四川省成都市崇州市崇阳街道福兴街195-197号",
                "四川成都市新都区",
                "四川成都市温江区",
                "四川成都市彭州市",
                "四川省成都市龙泉驿区龙泉街道怡和新城F区1楼双龙路388号23栋附105-108号商铺",
                "四川省眉山市东坡区湖滨路北二段16号.领地凯旋国际公馆商铺",
                "安陆市解放大道东路1号丰达国际10栋111-112号商铺",
                "黑龙江省哈尔滨市道外区",
                "群力第七大道汇龙湾公馆B栋1号门市",
                "北方购物公寓2-04号门市",
                "河北省唐山市迁安市",
                "河北省石家庄市裕华区",
                "石家庄长安区谈北路与谈中街近水楼台底商B区113号",
                "河北省沧州市任丘市",
                "河北省保定市莲池区东俪湾小区18号楼1096号门脸",
                "衡水市桃城区体验服务中心",
                "河北省廊坊市大城县",
                "北京市北京市海淀区",
                "重庆市九龙坡区科技大道120号6幢2-4号",
                "太原市万柏林区千峰南路140号",
                "大同市城区体验服务中心",
                "山西省朔州市平鲁区",
                "临朐县朐山路5222号",
                "山东省潍坊市奎文区健康街与虞河路东银泉广场",
                "山东省潍坊市潍城区向阳路健康西街",
                "山东省淄博市桓台县中心大街3150号",
                "安徽省宿州市灵璧县",
                "山东省泰安市新泰市",
                "山东省德州市武城县",
                "领秀城北门东50米",
                "安徽省芜湖市南陵县经济开发区电子商务产业园大工山路宇培4号馆1-128",
                "安徽省宣城市泾县",
                "安徽省安庆市潜山县经济开发区皖潜大道0003号2栋1层102室",
                "安徽省滁州市天长市天康大道南侧静和花苑由东向西16号翼猫",
                "安徽省滁州市定远县东兴路裕安水上花园沿街商铺",
                "辽宁省辽阳市白塔区曙光新园三里街104号",
                "哈西大街与暨南大街交口东北角23栋1-2层11号",
                "山东省济南市商河县",
                "辽宁省葫芦岛市建昌县",
                "深圳市深圳市宝安区",
                "河南省焦作市山阳区定和街道远大山阳春天小区东门向北30米",
                "河南省焦作市解放区迎宾路龙源世家东门向北30米翼猫科技",
                "祁东县祁丰大道旁开福市场正对面鸿达汽贸二楼",
                "湖北省宜昌市兴山县古夫镇桑树拐小区68号",
                "安徽省宁国市山门北路1138号翼猫科技服务体验中心",
                "湖南省衡阳市衡阳县西渡镇万家灯火门面",
                "漳州市龙文区迎宾大道吉马国际家居广场西门电商园二楼翼猫科技",
                "安徽省淮北市杜集区方安路15号滨湖新城翰林苑17栋103",
                "邳州市泰州路山水澜庭商铺1号楼（沙沟湖西门)",
                "山东省聊城市冠县冉子路与东环路交叉口西260米路南",
                "湖北省黄冈市浠水县红烛路235号",
                "常州路盛天国际商业广场翼猫科技体验店",
                "湖南省益阳市沅江市桔城大道和巴山路口金鑫酒店旁",
                "江苏省滨海县人民北路589号翼猫体验服务中心",
                "湖南省怀化市洪江市黔城镇荷塘路阳光家园109-110门面",
                "南京市溧水区永阳镇体育公园69号3幢",
                "湖南省益阳市安化县南区罗马广场2-113.114",
                "建设西路88号(泰华富达金街8-6)",
                "湖南省长沙市望城区高塘岭街道刘家塘小区",
                "金苇中路16 弄 13号翼猫体验服务中心",
                "浙江省湖州市长兴经济开发区 白溪大道349号长兴翼猫服务站",
                "山东省聊城市高唐县鱼丘湖街道南湖路鱼丘圣景B10",
                "汝城县卢阳镇朝阳路和兴楼（农机局对面翼猫科技)",
                "辽宁省抚顺市新抚区",
                "威海市海滨北路109A号名品商务楼四楼",
                "湖南省益阳市南县兴盛西路涂家台火箭宾馆侧门",
                "深圳市龙岗区坂田街道天安云谷3C栋2101-2103",
                "广水市十里街道办事处翡翠山湖A4-107-205号",
                "安徽省阜阳市阜南县鹿城镇现代商贸城锦园4号楼110号",
                "安徽省池州市东至县尧渡镇东流路丽山秀水2幢104-105号",
                "福建省龙岩市新罗区北城街道工业路89号泰华实业科研楼五楼",
                "广东省深圳市福田保税区英达利科技数码园A座211",
                "湖北省十堰市房县滨河大道9号",
                "湖南省郴州市嘉禾县珠泉镇晋屏南路金泰华城小区31栋一楼",
                "河南省郑州市郑东新区聚源路与宏昌街交叉口西20米翼猫科技",
                "东莞市厚街镇桥头社区东溪东路104-105号",
                "宿迁市经开区欧洲花园西门54号商铺",
                "安徽省阜阳市临泉县城南新区辉隆大市场26幢B-108",
                "山东省东营市东营区东城清风湖大厦西邻",
                "浙江省台州市玉环市玉城街道榴岛大道223号",
                "路北区裕华嘉苑三期6号底商",
                "测试测试测试",
                "测试测试测试",
                "龙岩市连城县莲峰镇宝丰银都3楼311室",
                "慈利县零阳镇零阳西路4栋111-161",
                "桑植县何家坪",
                "河北省衡水市安平县红旗大街北方明珠底商翼猫科技",
                "和平县阳明镇和平大道聚隆花园A栋第壹层（03）号商铺",
                "湖北省襄阳市南漳县水鏡大道213号",
                "淮安市盱眙县帝景国际广场19幢105号",
                "江苏省盐城市盐都区开放大道588号",
                "江苏省盐城市亭湖区文港中路91号",
                "福建省泉州市丰泽区泉秀街道泉秀路中段北侧捷兴大厦2楼翼猫科技有限公司",
                "友谊南大街与南二环交口五里庄园底商东区107号",
                "山东省济南市章丘区唐人中心G1-118号",
                "蓬莱宝龙广场宝龙城二区5号楼154/155/156号翼猫体验服务中心",
                "山东省临沂市罗庄区盛庄街道贵和水韵华庭4号楼1号",
                "河北省保定市清苑区清苑北街535号",
                "四川省德阳市中江县南华镇金鱼街11号",
                "石家庄市建设北大街131号新浩城底商翼猫",
                "河南省鹤壁市淇滨区黄山路205号（鹤翔小学斜对面)翼猫科技",
                "靖州县渠阳镇吉祥街103-106号",
                "塘厦镇环市东路526号万科朗润园2211号商铺",
                "新化县天华南路天河新村5栋101-103号门面",
                "甘肃省白银市白银区",
                "香港特别行政区九龙油尖旺区",
                "哈该",
                "测试测试测试测试测试测试测试测昌辉大厦",
                "宝塔区",
                "浙江省宁波市高新区软件园",
                "测试地址",
                "平川大厦18楼",
                "江苏省淮安市盱眙县",
                "甘肃省嘉峪关市",
                "北京故宫",
                "南翔 779",
                "上海市黄浦区"
            ],
            startTime: new Date(),
            endTime: 0,
            data: [],
            res: [],
        };
        this.i=0;
        this.k=0;
        this.citySearch = null;
        this.geocoder = null;
        this.geolocation = null;
        this.timer = null;
    }

    componentWillMount() {
        this.timer = setInterval(() => {
            this.timed();
        }, 16);
    }
    componentDidMount() {
        document.title = 'Test';

        this.init();
    }

    /** 第1阶段 地图初始化，各种插件 **/
    init() {
        const d = _.cloneDeep(this.state.data);
        d.push('地图基本初始化');
        this.setState({
            data: d,
        });
        this.map = new AMap.Map("container", {
            zoom: 14,
        });
        // 加载定位插件
        this.map.plugin('AMap.Geolocation', () => {
            this.geolocation = new AMap.Geolocation({
                enableHighAccuracy: true,//是否使用高精度定位，默认:true
                maximumAge: 0,           //定位结果缓存0毫秒，默认：0
                convert: true,           //自动偏移坐标，偏移后的坐标为高德坐标，默认：true
                showButton: true,        //显示定位按钮，默认：true
                buttonPosition: 'LB',    //定位按钮停靠位置，默认：'LB'，左下角
                buttonOffset: new AMap.Pixel(10, 20),//定位按钮与设置的停靠位置的偏移量，默认：Pixel(10, 20)
                showMarker: true,        //定位成功后在定位到的位置显示点标记，默认：true
                showCircle: true,        //定位成功后用圆圈表示定位精度范围，默认：true
                panToLocation: true,     //定位成功后将定位到的位置作为地图中心点，默认：true
                zoomToAccuracy:true      //定位成功后调整地图视野范围使定位位置及精度范围视野内可见，默认：false
            });

            //this.map.addControl(this.geolocation);    // 左下角的定位按钮
            this.down('地图定位插件加载完成');
        });

        // 加载城市查询插件
        this.map.plugin('AMap.CitySearch', () => {
            this.citySearch = new AMap.CitySearch();
            this.down('城市查询插件加载完成');
        });

        // 加载地址转坐标插件 用于从详细地址找到经纬度
        AMap.service('AMap.Geocoder', () => {
            this.geocoder = new AMap.Geocoder();
            this.down('地址转坐标插件加载完成');
        });
    }

    down(msg) {
        const d = _.cloneDeep(this.state.data);
        d.push(msg);
        this.setState({
            data: d,
        });

        let now = this.i + 1;
        if (now >= 3) {
            this.step2();
        } else {
            this.i = now;
        }
    }

    /** 第2步 **/
    step2() {
        const d = _.cloneDeep(this.state.data);
        d.push('开始定位');
        this.setState({
            data: d,
        });

        // 定位用户当前坐标
        this.geolocation.getCurrentPosition((status, result) => {
            console.log('定位用户当前坐标：', status, result);
            if (status === 'complete') {
                const d = _.cloneDeep(this.state.data);
                d.push(`定位成功：${result.position.lng},${result.position.lat}`);
                d.push(`城市：${result.addressComponent.province},${result.addressComponent.district},${result.addressComponent.township}`);
                d.push('此时需向后端异步请求该区域下的服务站信息');
                this.setState({
                    data: d,
                });
                this.step3(result.position.lng, result.position.lat);
            } else {
                Toast.fail('定位失败', 1);
            }
        });
    }

    // 第3步，开始查各城市经纬度
    step3(userlng, userlat) {
        const d = _.cloneDeep(this.state.data);
        d.push('开始通过地址查询经纬度');
        for (let i=0; i< this.state.source.length ;i++) {
            this.checkAddr(this.state.source[i], userlng, userlat);
        }

    }

    // 通过地址查经纬度
    checkAddr(str, userlng, userlat) {
        const d = _.cloneDeep(this.state.data);
        this.geocoder.getLocation(str, (status, result) => {
            if (status === 'complete' && result.info === 'OK' && result.geocodes.length) {
                //TODO:获得了有效经纬度，可以做一些展示工作
                //比如在获得的经纬度上打上一个Marker
                const XYInfo = result.geocodes[0].location;
                d.push(`获取成功：${str},${XYInfo.lng}, ${XYInfo.lat}`);
                this.setState({
                    data: d,
                });
                this.makeLeng(userlng, userlat, XYInfo.lng, XYInfo.lat, str);
            }else{
                //获取经纬度失败
                d.push(`未知地址:${str}`);
                this.setState({
                    data: d,
                });
            }
            this.down3();
        });
    }

    down3() {
        this.k++;
        if (this.k >= this.state.source.length) {
            clearInterval(this.timer);
            const d = _.cloneDeep(this.state.data);
            d.push('全部执行完成，总耗时(s)：', this.state.endTime);
            this.setState({
                data: d,
            });
        }
    }
    // 计算两坐标点间距离
    makeLeng(x1,y1,x2,y2, str) {
        const d = _.cloneDeep(this.state.res);
        const lnglat1 = new AMap.LngLat(x1, y1);
        const lnglat2 =  new AMap.LngLat(x2, y2);
        const r = Math.round(lnglat1.distance(lnglat2));
        d.push([str, r]);
        this.setState({
            res: d,
        });
    }

    // 总共用了多少时间
    timed() {
        const time = new Date();
        this.setState({
            endTime: (time.getTime() - this.state.startTime.getTime()) / 1000,
        });
    }
    render() {
        return (
            <div className="page-notfound">
                <div>
                    <div>结果：</div>
                    <hr />
                    <ul>
                        { this.state.res.map((item, index) => {
                            return <li key={index}>{ `${item[0]}：${item[1]}米` }</li>;
                        }) }
                    </ul>
                </div>
                <div>
                    <div>过程：(用时：{ this.state.endTime }s)</div>
                    <hr />
                    <div>
                        <ul>
                            { this.state.data.map((item, index) => {
                                return <li key={index}>{ item }</li>;
                            }) }
                        </ul>
                    </div>
                </div>
                <div id="container"/>
            </div>
        );
    }
}

// ==================
// PropTypes
// ==================

TestContainer.propTypes = {
    actions: P.any,
};

// ==================
// Export
// ==================

export default connect(
    (state) => ({

    }),
    (dispatch) => ({
        actions: bindActionCreators({ wxPay }, dispatch),
    })
)(TestContainer);
